#include<stdio.h>
int a[10005][260];
int main(){
	int n,i,j;
	a[1][1]=1;
	a[2][1]=1;
	a[3][1]=1;
	a[4][1]=1;
	for(i=5;i<10005;i++){
			for(j=1;j<=260;j++)
				a[i][j]=a[i-1][j]+a[i-2][j]+a[i-3][j]+a[i-4][j];//通过这一步实现八位进制间的相加； 
			for(j=1;j<=260;j++){
				if(a[i][j]>=100000000){//满八位向前进一位 
					a[i][j+1]+=a[i][j]/100000000;//不要把'+'忘记了 
					a[i][j]%=100000000;
				}
			}
	}
	while(~scanf("%d",&n)){
		for(j=260;j>=1;j--){//注意，要去掉初始化的多余的0 
			if(a[n][j]!=0)
				break;
		}
		printf("%d",a[n][j]);//首位直接输出 
		for(j=j-1;j>=1;j--){
			printf("%08d",a[n][j]);//接下来不足八位前面用0补齐 
		}
		printf("\n");
	}
	return 0;
} 
